[
  {
    "name":"[Allegiance]",
    "type":"traits",
    "description":"This unit is either a Loyalist or a Traitor, and all models in the army must be from the same Allegiance"
  },
  {
    "name":"[Legiones Astartes]",
    "type":"traits",
    "description":"This unit is considered to be of a specific Legion, and all units selected as part of a given Detachment must have the same [Legiones Astartes] Trait."
  },
  {
    "name":"Legiones Astartes (Iron Warrior)",
    "type":"traits",
    "description":"This unit is considered to be of the Iron Warriors Legion, and all units selected as part of a given Detachment must have the Iron Warriors Trait."
  },
  {
    "name":"Master of the Legion",
    "type":"traits",
    "description":"I think this gives an Apex detachment."
  },
  {
    "name":"Smokescreen",
    "type":"traits",
    "description":"Grants the Smokescreen reaction."
  },
  {
    "name":"Infantry",
    "type":"type",
    "description":"Infantry is the most basic Type, and is applied to most models in the game. They use the Core Rules without modification, gaining neither benefit nor penalty. Models with the Infantry Type may Embark and Disembark on Transports."
  },
  {
    "name":"Cavalry",
    "type":"type",
    "description":"The following rules apply to all models with the Cavalry Type:\n- When making a fall back move, they move a distance equal to their initiative plus the total of two dice rolled and added together\n- May not make use of any cover save granted by terrain features or areas of terrain"
  },
  {
    "name":"Walker",
    "type":"type",
    "description":"The following rules apply to all models with the Walker Type:\n- Effects of the Poisoned (x) Special Rule only trigger on a Wound Test with a result of a '6' before modifiers.\n- May attack with all weapons they have in each shooting attack, including reactions. Does not apply to weapons without the 'Assault' trait during Volley attacks.\n- When deciding how many Models a player controls in a Combat, they count as the number of models as equal to their base wounds value."
  },
  {
    "name":"Paragon",
    "type":"type",
    "description":"The following rules apply to all models with the Paragon Type:\n- Any hits are allocated by the controlling player to the target unit\n- May join or be joined by any unit of Infantry type models\n- May Embark and disembark on Transports\n- May Issue and Accept Challenges\n- A Unit may use the characteristics of the Paragon type model to resolve Characteristic Checks\n- When deciding how many Models a player controls in a Combat, they count as the number of models as equal to their base wounds value."
  },
  {
    "name":"Automata",
    "type":"type",
    "description":"The following rules apply to all models with the Automata Type:\n- Cannot gain any Tactical Statuses and pass any Check made to avoid a Tactical Status.\n- Effects of the Poisoned (x) Special Rule only trigger on a Wound Test with a result of a '6' before modifiers.\n- A unit that includes this type may not make reactions."
  },
  {
    "name":"Unique",
    "type":"sub-type",
    "description":"The following rules apply to all models with the Unique Sub-Type:\n- An army may not include more than a single instance.\n- May not have any options other than those included on its Army list Profile."
  },
  {
    "name":"Command",
    "type":"sub-type",
    "description":"The following rules apply to all models with the Command Sub-Type:\n- May join and leave units\n- May Issue and Accept Challenges\n- A Unit may use the characteristics of the Command Sub-Type model to resolve Characteristic Checks"
  },
  {
    "name":"Champion",
    "type":"sub-type",
    "description":"Models with the Champion Sub-Type may Issue and Accept Challenges"
  },
  {
    "name":"Specialist",
    "type":"sub-type",
    "description":"Models with the Specialist Sub-Type may join and leave units"
  },
  {
    "name":"Sergeant",
    "type":"sub-type",
    "description":"Units containing a model with the Sergeant Sub-Type may use the characteristics of the Sergeant Sub-Type model to resolve Characteristic Checks"
  },
  {
    "name":"Heavy",
    "type":"sub-type",
    "description":"The following rules apply to all models with the Heavy Sub-Type:\n- A Unit that includes only models with this Sub-Type gain a bonus of +1 to their Cool Characteristic for Checks to avoid gaining Tactical Statuses.\n- May not Rush.\n- Only uses its Movement Characteristic to determine how far it moves as part of a Set-up Move, and does not include Initiative."
  },
  {
    "name":"Light",
    "type":"sub-type",
    "description":"The following rules apply to all models with the Light Sub-Type:\n- A Unit that includes only models with this Sub-Type gain a bonus of +1 to their Initiative when determining how far that Unit may Rush (this stacks with other bonuses).\n- A unit that includes this type may make shooting attacks as Snap Shots. Models and weapons that cannot attack as snap shots still may not make attacks."
  },
  {
    "name":"Skirmish",
    "type":"sub-type",
    "description":"A unit that includes only Models with the Skirmish Sub-Type has a Unit Coherency range of 3\" rather than 2\"."
  },
  {
    "name":"Antigrav",
    "type":"sub-type",
    "description":"A unit that includes only Models with the Antigrav Sub-Type may:\n- Ignore the effects of any and all Terrain it passes over during movement\n- Ignore both friendly and enemy models and units when moving"
  },
  {
    "name":"Transport",
    "type":"sub-type",
    "description":"Models with the transport sub-type:\n- Have a maximum transport capacity characteristic\n- May only carry Infantry or Paragon Type units\n- May only carry models of the same faction\n- May only carry one unit at a time (joined models count as part of the unit)\n- May not carry part of a unit\n- Are not considered the same unit as the unit they carry"
  },
  {
    "name":"Same Faction",
    "type":"detachment",
    "description":"Must be the same Faction as the Primary Detachment."
  },
  {
    "name":"Points Limit",
    "type":"detachment",
    "description":"May only be selected in a 3,000 Point+ Army."
  },
  {
    "name":"Any Faction",
    "type":"detachment",
    "description":"May be of any Faction."
  },
  {
    "name":"Must be a different Faction than Primary",
    "type":"detachment",
    "description":"Must be a different Faction than Primary."
  },
  {
    "name":"May include Auxillary Detachments",
    "type":"detachment",
    "description":"May include Auxillary Detachments."
  },
  {
    "name":"Armourbane",
    "type":"special_rule",
    "description":"A Weapon with the Armourbane Special Rule counts Glancing Hits as Penetrating Hits."
  },
  {
    "name":"Assault Vehicle",
    "type":"special_rule",
    "description":"A Vehicle with this Special Rule allows Models to Disembark and Charge without penalty."
  },
  {
    "name":"Auto-repair (X)",
    "type":"special_rule",
    "description":"A Model with this Special Rule has a bonus to Repair Tests to remove Statuses."
  },
  {
    "name":"Barrage (X)",
    "type":"special_rule",
    "description":"A Weapon with this Special Rule may be used to attack Target Units out of Line of Sight."
  },
  {
    "name":"Battlesmith (X)",
    "type":"special_rule",
    "description":"A Model with the Battlesmith (X) Special Rule can repair Vehicles, Automata and other mechanical Units."
  },
  {
    "name":"Blast (X)",
    "type":"special_rule",
    "description":"Attacks made with the Blast (X) Special Rule use a Blast Marker to determine how many Hits are caused."
  },
  {
    "name":"Breaching (X)",
    "type":"special_rule",
    "description":"With a Weapon that has the Breaching (X) Special Rule there is a chance that a Wound Test may result in the Wound ignoring Armour Saves."
  },
  {
    "name":"Bulky (X)",
    "type":"special_rule",
    "description":"Models with the Bulky (X) Special Rule take up more space on Transport Models."
  },
  {
    "name":"Critical Hit (X)",
    "type":"special_rule",
    "description":"Attacks made with the Critical Hit (X) Special Rule have a chance to automatically cause a wound and inflict 1 extra point of damage."
  },
  {
    "name":"Deep Strike",
    "type":"special_rule",
    "description":"The Deep Strike Special Rule allows a Unit to enter play anywhere on the Battlefield."
  },
  {
    "name":"Deflagrate (X)",
    "type":"special_rule",
    "description":"Unsaved Wounds inflicted by attacks with the Deflagrate (X) Special Rule can cause additional Hits."
  },
  {
    "name":"Detonation",
    "type":"special_rule",
    "description":"Weapons with this Special Rule can only attack Vehicles and immobile Models."
  },
  {
    "name":"Duellist's Edge (X)",
    "type":"special_rule",
    "description":"A Weapon with the Duellist's Edge (X) Special Rule grants a bonus to Focus Rolls in Challenges."
  },
  {
    "name":"Eternal Warrior (X)",
    "type":"special_rule",
    "description":"A Model with this Special Rule takes less Damage from attacks."
  },
  {
    "name":"Expendable (X)",
    "type":"special_rule",
    "description":"A Player scores less Victory Points when they destroy a Unit that includes only Models with this Special Rule."
  },
  {
    "name":"Explodes (X)",
    "type":"special_rule",
    "description":"A Model with this Special Rule can explode and cause Hits to nearby Models and Units."
  },
  {
    "name":"Fast (X)",
    "type":"special_rule",
    "description":"A Unit that only includes Mmodels with the Fast (X) Special Rule gains a bonus to Rush and Charge Moves."
  },
  {
    "name":"Fear (X)",
    "type":"special_rule",
    "description":"Models near an enemy Model with the Fear (X) Special Rule must reduce their Advanced Characteristics."
  },
  {
    "name":"Feel No Pain (X)",
    "type":"special_rule",
    "description":"Feel No Pain (X) is a Damage Mitigation Test that may be taken in addition to a Saving Throw."
  },
  {
    "name":"Firing Protocols (X)",
    "type":"special_rule",
    "description":"A Model with the Firing Protocols (X) Special Rule may attack with more than one ranged weapon."
  },
  {
    "name":"Force (X)",
    "type":"special_rule",
    "description":"A Weapon with this Special Rule may double a Characteristic with a Willpower Check, but may suffer Perils of the Warp."
  },
  {
    "name":"Hatred (X)",
    "type":"special_rule",
    "description":"The Hatred (X) Special Rule grants bonuses against enemies of a specific Faction, Type or Trait."
  },
  {
    "name":"Heavy (X)",
    "type":"special_rule",
    "description":"Weapons with the Heavy (X) Special Rule gain _1 to a Characteristic when Stationary."
  },
  {
    "name":"Heedless",
    "type":"special_rule",
    "description":"A Unit that includes any Models with this Special Rule cannot claim Objectives."
  },
  {
    "name":"Impact (X)",
    "type":"special_rule",
    "description":"On a successful Charge, a Model with the Impact (X) Special Rule temporarily increases a Characteristic by 1."
  },
  {
    "name":"Infiltrate (X)",
    "type":"special_rule",
    "description":"Models with the Infiltrate (X) Special Rule can deploy outside of their Deployment Zone."
  },
  {
    "name":"Light Transport",
    "type":"special_rule",
    "description":"Models with this Special Rule cannot carry models with the Bulky (X) Special Rule."
  },
  {
    "name":"Limited (X)",
    "type":"special_rule",
    "description":"A Weapon with the Limited (X) Special Rule can only be used to attack a limited number of times per Battle."
  },
  {
    "name":"Line (X)",
    "type":"special_rule",
    "description":"A Unit of Models with this Special Rule can control Objectives more easily and scores more Victory Points from controlling an Objective."
  },
  {
    "name":"Move Through Cover",
    "type":"special_rule",
    "description":"The Move Through Cover Special Rule allows the penalties of terrain to be ignored."
  },
  {
    "name":"Officer of the Line (X)",
    "type":"special_rule",
    "description":"Models with this Special Rule allow more Auxillary Detachments to be included in an Army."
  },
  {
    "name":"Ordnance (X)",
    "type":"special_rule",
    "description":"Weapons with the Ordnance (X) Special Rule double the value of a Characteristic when Stationary."
  },
  {
    "name":"Outflank",
    "type":"special_rule",
    "description":"A Unit of Models with the Outflank Special Rule can enter play from outside of Deployment Zones."
  },
  {
    "name":"Panic (X)",
    "type":"special_rule",
    "description":"Weapons and other attacks that have the Panic (X) Special Rule have a chance of inflicting the Routed Status on the Target Unit."
  },
  {
    "name":"Phage (X)",
    "type":"special_rule",
    "description":"Unsaved Wounds with the Phage (X) Special Rule reduce a Characteristic by 1."
  },
  {
    "name":"Pinning (X)",
    "type":"special_rule",
    "description":"Weapons and other attacks that have the Pinning (X) Special Rule have a chance of inflicting the Pinned Status on the Target Unit."
  },
  {
    "name":"Pistol",
    "type":"special_rule",
    "description":"A Model may attack with two Weapons that have the Pistol Special Rule."
  },
  {
    "name":"Poisoned (X)",
    "type":"special_rule",
    "description":"A Weapon with the Poisoned (X) Special Rule has a chance to cause a wound regardless of the target's Toughness."
  },
  {
    "name":"Precision (X)",
    "type":"special_rule",
    "description":"Attacks made with the Precision (X) Special Rule are allocated by the Attacking Player, not the Defender."
  },
  {
    "name":"Reaping Blow (X)",
    "type":"special_rule",
    "description":"If a Model with this Special Rule is outnumbered, it gains extra attacks."
  },
  {
    "name":"Rending (X)",
    "type":"special_rule",
    "description":"With a Weapon that has the Rending (X) Special Rule, there is a chance that a Hit Test may result in an automatic wound."
  },
  {
    "name":"Shock (X)",
    "type":"special_rule",
    "description":"Weapons with the Shock (X) Special Rule have a chance of inflicting Statuses on Vehicles even if it does not penetrate their armour."
  },
  {
    "name":"Shred (X)",
    "type":"special_rule",
    "description":"Attacks made with the Shred (X) Special Rule can sometimes inflict an extra point of damage."
  },
  {
    "name":"Shrouded (X)",
    "type":"special_rule",
    "description":"Shrouded (X) is a Damage Migration Test that may be taken in addition to a Saving Throw."
  },
  {
    "name":"Skyfire",
    "type":"special_rule",
    "description":"Attacks made with the Skyfire Special Rule ignore penalties when attacking Flyers."
  },
  {
    "name":"Stun (X)",
    "type":"special_rule",
    "description":"Weapons and other attacks that have the Stun (X) Special Rule have a chance of inflicting the Stunned Status on the Target Unit."
  },
  {
    "name":"Support Unit (X)",
    "type":"special_rule",
    "description":"A Unit that includes Models with this Special Rule scores fewer Victory Points for controlling Objective Markers."
  },
  {
    "name":"Suppressive (X)",
    "type":"special_rule",
    "description":"Weapons and other attacks that have the Suppressive (X) Special Rule have a chance of inflicting the Suppressed Status on the Target Unit."
  },
  {
    "name":"Template",
    "type":"special_rule",
    "description":"Weapons and attacks with the Template Special Rule use the Flame Template to determine how many Models they Hit."
  },
  {
    "name":"Vanguard (X)",
    "type":"special_rule",
    "description":"A Unit that includes Models with this Special Rule scores fewer Victory Points for controlling Objectives, but can score Victory Points for destroying enemy Units that hold Objectives."
  },
  {
    "name":"Implacable Advance",
    "type":"special_rule",
    "description":"May fire Heavy Weapons without a penality."
  },
  {
    "name":"Overload (X)",
    "type":"special_rule",
    "description":"With a Weapon that has the Overload (X) Special Rule, there is a chance that a Hit Test may result in a wound to the user."
  },
  {
    "name":"Slow and Purposeful",
    "type":"special_rule",
    "description":null
  }
]